# Assignment 5

In [1]:
from pymongo import MongoClient
import pymongo
from bson.objectid import ObjectId
import pandas as pd
# !pip install plotly==4.14.3
import plotly.express as px
from IPython.display import HTML
from datetime import datetime


pd.set_option('display.max_columns', None)  
pd.set_option('display.expand_frame_repr', False)
pd.set_option('max_colwidth', None)


db_url="mongodb://mongodb:mongodb@cluster0-shard-00-00.wxx0a.mongodb.net:27017,cluster0-shard-00-01.wxx0a.mongodb.net:27017,cluster0-shard-00-02.wxx0a.mongodb.net:27017/test?ssl=true&replicaSet=atlas-p5zfhi-shard-0&authSource=admin&retryWrites=true&w=majority"
client = MongoClient(db_url)

# See all databases: list(client.list_databases())
airbnb=client['sample_airbnb']['listingsAndReviews']
geospatial=client['sample_geospatial']['shipwrecks']
netflix=client['sample_mflix']
# theaters,comments, movies
supplies=client['sample_supplies']['sales']
training=client['sample_training']
# grades, routes, trips, stories, inspections,companies, tweets, posts, zips
weather=client['sample_weatherdata']['data']
grades = training['grades'] 
movies = netflix.movies
companies = training['companies']



# Post QUESTION 17
db2 = 'mongodb://m121:aggregations@cluster0-shard-00-00-jxeqq.mongodb.net:27017,cluster0-shard-00-01-jxeqq.mongodb.net:27017,cluster0-shard-00-02-jxeqq.mongodb.net:27017/aggregations?replicaSet=Cluster0-shard-0&authSource=admin&ssl=true' 
client2 = MongoClient(db2)
air_routes = client2.aggregations.air_routes
air_airlines = client2.aggregations.air_airlines
parent_reference = client2.aggregations.parent_reference
employees = client2.aggregations.employees
icecream_data = client2.aggregations.icecream_data
stocks = client2.aggregations.stocks
customers = client2.aggregations.customers
air_alliances = client2.aggregations.air_alliances
solarSystem = client2.aggregations.solarSystem
exoplanets = client2.aggregations.exoplanets
nycFacilities = client2.aggregations.nycFacilities



def show_table(x):
  table=pd.DataFrame(list(x))
  if table.empty:
    return 'No results'
  else:
    return table

def show_figure(fig):
  return HTML(fig.to_html())

## Question 1

In the supplies collection, write the following query:
~~~
1) FILTER on the "purchaseMethod" field with a value of "Online"
2) GROUP by "items.name". "items" is an array of objects so make sure to unwind it first. SUM the number per grouping as "total"
3) SORT by "total" descending
4) LIMIT to 3 results
~~~

       _id  total
0  notepad   2146
1   binder   1491
2     pens   1432

In [2]:
pipeline = [{"$match":{
               "purchaseMethod": {'$eq':"Online"}
            }},
            {"$unwind":'$items'},

            {"$group":{
                "_id": "$items.name",
                "total": {"$sum": 1},

            }},


            {"$sort":{
                'total':-1
            }},
            {"$limit": 3},
]


show_table(supplies.aggregate(pipeline))

       _id  total
0  notepad   2146
1   binder   1491
2     pens   1432

## Question 2

Same as the query above, but instead GROUP BY the "items.tags" field value. "items" is an array of objects with "tags" as an array in the objects, so you may have to unwind them. 

~~~
GROUP by "items.tags" and compute the sum as "total"
SORT by the "total" descending
LIMIT to the top 5
~~~

In [5]:
pipeline = [{"$match":{
               "purchaseMethod": {'$eq':"Online"}
            }},
            {"$unwind":'$items'},
            {"$unwind":'$items.tags'},

            {"$group":{
                "_id": "$items.tags",
                "total": {"$sum": 1},

            }},


            {"$sort":{
                'total':-1
            }},
            {"$limit": 5},
]


show_table(supplies.aggregate(pipeline))

          _id  total
0      school   6503
1      office   6384
2     writing   3578
3  stationary   3513
4     general   2887

## Question 3

In the training.posts collection, write the following query:
~~~
1) FILTER on "tags" array not in the following values: "philosophy","governor" and "title" not equal to "Gettysburg Address"
2) GROUP by "comments.author" and compute the total count of documents per grouping as "total". "comments" is an array of objects - so keep this in mind as you group 
3) SORT by "total" descending
4) LIMIT to 3 results
~~~

               _id  total
0  Elizabet Kleine    204
1  Rudolph Domingo    190
2     Cody Strouth    187

In [6]:
pipeline = [{"$match":{
               "tags": {'$nin':["philosophy","governor"]},
                 "title": {'$ne':"Gettysburg Address"}
            }},
            {"$unwind":"$comments"},

            {"$group":{
                "_id": "$comments.author",
                "total": {"$sum": 1},

            }},


            {"$sort":{
                'total':-1
            }},
            {"$limit": 3},
]


show_table(training.posts.aggregate(pipeline))

               _id  total
0  Elizabet Kleine    204
1  Rudolph Domingo    190
2     Cody Strouth    187

## Question 4

In the training.companies collection, write the following query:
~~~
1) FILTER on "relationships" array of objects with at least one object where "relationships.title" is "President & CEO" and "relationships.is_past" is True

2) GROUP by "founded_year" as "founded_year", "funding_rounds.funded_year" as "funded_year" and compute the different between these two fields using the $subtract operator (see below) and give it the alias "difference". Compute the count of documents in these groupings as "count". 

ALSO NOTE -- "funding_rounds.funded_year" is a field in an array of objects, so you may have to unwind it first.

$subtract operator:
{"$subtract": [ <field1>, <field2> ] }

3) FILTER out where the "difference" is None
4) SORT "founded_year" descending, "difference" ascending, "count" descending
5) LIMIT to 3 results
~~~

In [13]:
pipeline = [{'$match':{"relationships":{"$elemMatch":{'title':'President & CEO', 'is_past':True}} }},
            {"$unwind":"$funding_rounds"},
                        
            {"$group":
                 {"_id": {"founded_year":"$founded_year",
                         "funded_year":"$funding_rounds.funded_year",
                          "difference":{"$subtract":["$funding_rounds.funded_year","$founded_year"]}
                         },
                  
                "count": {"$sum": 1}
            }},

            {"$match":{
               "_id.difference": {"$ne":None}                
            }},  
            {"$sort":{
                "_id.founded_year":-1, "_id.difference":1,"count":-1
            }},
            {"$limit": 3},
]
show_table(training.companies.aggregate(pipeline))

                                                             _id  count
0  {'founded_year': 2008, 'funded_year': 2007, 'difference': -1}      1
1   {'founded_year': 2008, 'funded_year': 2009, 'difference': 1}      1
2   {'founded_year': 2007, 'funded_year': 2007, 'difference': 0}      1

                                                             _id  count
0  {'founded_year': 2008, 'funded_year': 2007, 'difference': -1}      1
1   {'founded_year': 2008, 'funded_year': 2009, 'difference': 1}      1
2   {'founded_year': 2007, 'funded_year': 2007, 'difference': 0}      1

### BONUS (2 points)

Group by year and return the highest differences between the founded year and funded year. Sort by founded year ascending and limit to 5 results. Filter out the result of None for founded_year

    _id  max_diff
0  1961        49
1  1995        13
2  1996        18
3  1998        12
4  1999        12

In [3]:
pipeline = [{'$match':{"relationships":{"$elemMatch":{'title':'President & CEO', 'is_past':True}} }},
            {"$unwind":"$funding_rounds"},
            {"$unwind":"$funding_rounds.funded_year"},            
            {"$group":
                 {"_id": {"founded_year":"$founded_year",
                         "funded_year":"$funding_rounds.funded_year",
                          "difference":{"$subtract":["$funding_rounds.funded_year","$founded_year"]}
                         },
                  
                "count": {"$sum": 1}
            }},

            {"$match":{
               "_id.difference": {"$ne":None}                
            }},  
            {"$sort":{
                 "_id.difference":-1
            }},
            {"$group":
                 {"_id": "$_id.founded_year",
                  "max_diff":{'$first':"$_id.difference"}

            }},
            {"$sort":{
                 "_id":1
            }},
            {"$limit": 5}
]
show_table(training.companies.aggregate(pipeline))

    _id  max_diff
0  1961        49
1  1995        13
2  1996        18
3  1998        12
4  1999        12

## Question 5

In the companies collection, write the following query:
~~~
1) GROUP on category code and sum the length of the "funding" array as "num_funding"
2) FILTER on "num_funding" greater than 300 but less than 600
3) SORT by "num_funding" descending
4) LIMIT to 3 results
~~~

           _id  num_funding
0   enterprise          482
1       mobile          429
2  advertising          406

In [18]:
pipeline = [            {"$project":{
                "num_finding":{'$size':'$funding_rounds'},
                 "category_code":1
            }},

    
            {"$group":{
                "_id": "$category_code" ,

            "num_funding":{'$sum':"$num_finding"}}},
            {"$match":{
               "num_funding": {"$gt":300,'$lt':600}                
            }},  
  
            {"$sort":{
                 "num_funding":-1
            }},
            {"$limit": 3},
]


show_table(companies.aggregate(pipeline))

           _id  num_funding
0   enterprise          482
1       mobile          429
2  advertising          406

## Question 6

In the companies collection, write the following query:
~~~
1) GROUP on the size of the "funding_rounds" array, the size of the "competitions" array, the difference between the size of the "funding_rounds" array and the "competitions" array (i.e. funding_rounds - competitions) as "difference", and compute the count of this grouping as "count". You may use the $PROJECT stage before this stage..
2) GROUP on the "difference", and select from the previous grouping the object with the highest "funding" and "competition" array size. You may need to SORT beforehand. Also compute the count of this grouping as "count".
5) SORT by "count" descending, and the "_id" descending
6) LIMIT to 5 results
~~~

   _id                                 max_diff  count
0    1    {'funding': 9, 'comp': 8, 'count': 1}      9
1    0  {'funding': 10, 'comp': 10, 'count': 1}      9
2   -3  {'funding': 11, 'comp': 14, 'count': 1}      9
3    2    {'funding': 9, 'comp': 7, 'count': 1}      8
4   -1    {'funding': 7, 'comp': 8, 'count': 1}      8

In [2]:
pipeline = [{"$project":{
                "funding_size":{'$size':"$funding_rounds"},
                "comp_size":{'$size':"$competitions"}
            }},

            {"$group":{
                 "_id": {
                    'funding' :"$funding_size", 
                     'comp' :"$comp_size",
                     "difference": {"$subtract": [ "$funding_size", "$comp_size" ] }},

                "count": {"$sum": 1}
            }},

            {"$sort":{
                "_id.funding":-1,"_id.comp" :-1
            }},
            {"$group":{
                 "_id":"$_id.difference" ,                
                'max_diff':{'$first':{'funding':'$_id.funding',
                                       'comp':"$_id.comp",
                                     "count": {"$sum": 1}}},
                "count": {"$sum": 1}
            }},
            {"$sort":{
                "count":-1,"_id" :-1
            }},            
            {"$limit": 5},
]


show_table(training.companies.aggregate(pipeline))

   _id                                 max_diff  count
0    1    {'funding': 9, 'comp': 8, 'count': 1}      9
1    0  {'funding': 10, 'comp': 10, 'count': 1}      9
2   -3  {'funding': 11, 'comp': 14, 'count': 1}      9
3    2    {'funding': 9, 'comp': 7, 'count': 1}      8
4   -1    {'funding': 7, 'comp': 8, 'count': 1}      8

## Question 7

In the training.companies collection, write the following query:
~~~
1) UNWIND the "funding_rounds" array and the "funding_rounds.investments" array
2) FILTER on "funding_rounds.investments.financial_org.name" field that does exist
3) GROUP by "funding_rounds.funded_year" as "year" and "funding_rounds.investments.financial_org.name" as "firm", compute the total count of documents as "total", and compute the average of the "funding_rounds.raised_amount" as "avg_round"
4) FILTER where total is greater than 2
5) SORT on "_id.year" descending, "total" descending, and "avg_round" descending
6) LIMIT to 3 results
~~~

                                                          _id  total     avg_round
0     {'year': 2013, 'firm': 'Draper Fisher Jurvetson (DFJ)'}     12  1.548444e+07
1  {'year': 2013, 'firm': 'Kleiner Perkins Caufield & Byers'}      7  3.620143e+07
2                    {'year': 2013, 'firm': 'Accel Partners'}      6  4.691853e+07

In [69]:
pipeline = [
            {"$unwind":"$funding_rounds" },
            {"$unwind":"$funding_rounds.investments"  },
            {"$match":{
               "funding_rounds.investments.financial_org.name" :{'$exists':True}}} ,   

            {"$group":{
                 "_id": {
                    "year" :"$funding_rounds.funded_year", 
                     "firm":"$funding_rounds.investments.financial_org.name"},

                "total": {"$sum": 1},
                "avg_round":{'$avg':"$funding_rounds.raised_amount"}

            }},
            {"$match":{
               "total": {"$gt":2}                
            }},

            {"$sort":{
                "_id.year":-1,"total" :-1,"avg_round":-1
            }},
            {"$limit": 3},
]


show_table(training.companies.aggregate(pipeline))

                                                          _id  total     avg_round
0     {'year': 2013, 'firm': 'Draper Fisher Jurvetson (DFJ)'}     12  1.548444e+07
1  {'year': 2013, 'firm': 'Kleiner Perkins Caufield & Byers'}      7  3.620143e+07
2                    {'year': 2013, 'firm': 'Accel Partners'}      6  4.691853e+07

## Question 8

Modify Quesiton 7 to group by year and include the highest "avg_round" as "highest_avgRound" and "firm" as "firm". Remember to sort the list and then collect the first value of that sorted list per year. Sort the final grouping by "year" descending. Limit to 3 results.

    _id  highest_avgRound                            firm
0  2013      1.242500e+08  The Social+Capital Partnership
1  2012      1.116667e+08                   Founders Fund
2  2011      6.655000e+08        Digital Sky Technologies

In [10]:
pipeline = [
            {"$unwind":"$funding_rounds" },
            {"$unwind":"$funding_rounds.investments"  },
            {"$match":{
               "funding_rounds.investments.financial_org.name" :{'$exists':True}}} ,   

            {"$group":{
                 "_id": {
                    "year" :"$funding_rounds.funded_year", 
                     "firm":"$funding_rounds.investments.financial_org.name"},

                "total": {"$sum": 1},
                "avg_round":{'$avg':"$funding_rounds.raised_amount"}

            }},
            {"$match":{
               "total": {"$gt":2}                
            }},

            {"$sort":{
                "_id.year":-1,"avg_round":-1
            }},

            {"$group":{
                 "_id": '$_id.year',
                "highest_avgRound":{'$first':"$avg_round"},
                "firm":{'$first':"$_id.firm"}

                

            }}, 
            {"$sort":{
                '_id':-1
            }},
            {"$limit": 3},
]


show_table(training.companies.aggregate(pipeline))

    _id  highest_avgRound                            firm
0  2013      1.242500e+08  The Social+Capital Partnership
1  2012      1.116667e+08                   Founders Fund
2  2011      6.655000e+08        Digital Sky Technologies

## Question 9

In the training.companies collection, write the following query 
~~~
1) UNWIND the "funding_rounds" array
2) GROUP BY "funding_rounds.funded_year" as "year", and "funding_rounds.round_code" as "round". Then compute the following per grouping:
    - average of the "funding_rounds.raised_amount" as "avg_raise"
    - sum the size of the "funding_rounds.investments" array as "investment_array"  
3) SORT by "avg_raise" descending, "investment_array" descending
4) GROUP on "round", and return the highest "avg_raise", "investment_array" and "year" as "raise", "investment_array" and "date" respectively.
5) SORT on "date" descending, and "raise" descending
6) LIMIT to 3 results
~~~

In [3]:
pipeline = [
            {"$unwind":"$funding_rounds" },  

            {"$group":{
                 "_id": {
                    "year" :"$funding_rounds.funded_year", 
                     "round":"$funding_rounds.round_code"},

                "avg_raise": {"$avg": "$funding_rounds.raised_amount"},
                "investment_array" :{'$sum':{'$size':"$funding_rounds.investments"}}

            }},
            {"$sort":{
                "avg_raise":-1,"investment_array" :-1
            }},
            {"$group":{
                 "_id": '$_id.round',
                "date":{'$first':"$_id.year"},
                "raise":{'$first':"$avg_raise"},
                "investment_array":{'$first':"$investment_array"},
                
                

            }},
            {"$sort":{
                "date":-1,"raise" :-1
            }},
        

            {"$limit": 3},
]


show_table(training.companies.aggregate(pipeline))

            _id  date         raise  investment_array
0  unattributed  2014  1.013500e+08                 2
1    debt_round  2013  5.397710e+07                34
2       partial  2013  8.822784e+06                 4

            _id  date         raise  investment_array
0  unattributed  2014  1.013500e+08                 2
1    debt_round  2013  5.397710e+07                34
2       partial  2013  8.822784e+06                 4

## Question 10

In the exoplanets collection, write the following query:
~~~
1) GROUP on "system.planet.letter" as "planet" and "system.numbers_of_planets" as "numbers_of_planets" and compute the count for this grouping as "count" 
2) GROUP on "numbers_of_planets", and return the document with the heighest "count" and lowest "planet" value as "planet", with the following attributes: "count" as "count", "planet" as "letter". Also:
    - sum the number of documents per this grouping as "grouping_count"
    - sum the "count" of the input documents from the last grouping as "total"
3) SORT on "numbers_of_planets" descending
4) LIMIT to 3 results
~~~

In [115]:
pipeline = [

            {"$group":{
                 "_id": {
                    "planet" :"$system.planet.letter", 
                     "numbers_of_planets":"$system.numbers_of_planets"},
                'count':{'$sum':1}
            }},
            {"$sort":{
                "count":-1,"_id.planet" :1
            }},
            {"$group":{
                 "_id": "$_id.numbers_of_planets",
                'planet':{'$first':{'letter':'$_id.planet',
                                       'count':'$count'}},
                "grouping_count":{'$sum':1},
                "total":{'$sum':"$count"}
                

            }},
            {"$sort":{
                "_id":-1
            }},
        

            {"$limit": 3},
]


show_table(exoplanets.aggregate(pipeline))

  _id                        planet  grouping_count  total
0   7   {'letter': 'b', 'count': 1}               7      7
1   6   {'letter': 'c', 'count': 3}               7     18
2   5  {'letter': 'b', 'count': 19}               6     95

  _id                        planet  grouping_count  total
0   7   {'letter': 'b', 'count': 1}               7      7
1   6   {'letter': 'c', 'count': 3}               7     18
2   5  {'letter': 'b', 'count': 19}               6     95